package days08;

/**
 * @author kenik
 * @date 2023. 2. 6. - 오후 2:35:57
 * @subject   메서드(함수) 설명
 * @content
 *
 */
public class Ex03 {

	public static void main(String[] args) {
		/*
		 * 1. 메서드(함수) 정의 ? 프로그래밍에서 [반복되는 명령어들]을 찾아서 별로 묶어서
		 *                                    필요할 때 마다 불러서 사용할 수 있도록 한 것.
		 * 2. 프로그램의 구조화 -> 유지, 보수 편리
		 * 3. 반복되는 코딩 -> 구조화  (  재사용 코딩 )
		 * 4. 함수가 기본이 되는 프로그래밍 방식 :  구조적 프로그래밍 언어 - C언어                                   
		 * 5. 객체가 기본이 되는 프로그래밍 방식 :  객체 지향적 프로그래밍 언어 -  Java ,  대부분의 언어
		 *                                                                OOP
		 *  6. 함수 선언 형식
		 *                수정자(modifier)
		 *      [접근지정자] [기타제어자]  리턴자료형  함수명([매개변수...])  함수 원형 == 함수 프로토타입 , 함수 선언부
		 *      {     함수 몸체 {}  구현부
		 *         
		 *           [return 리턴값;]
		 *      } 
		 *   7. 함수 3가지 이해
		 *      1) 기능
		 *      2) 매개변수
		 *      3) 리턴값( 리턴자료형 )        
		 *      
		 *   8. 예)  Ex03_02.java 
		 *                                                                                                   
		 * */

	} // main

} // class











