package days04;

/**
 * @author kenik
 * @date  2023. 1. 31. - 오전 11:23:02
 * @subject 
 * @content 
 *
 */
public class Ex03 {

	public static void main(String[] args) {
		/*
		 * [ 연산자 우선 순위 높은 것 부터 ]
		 * [1]. 단항 연산자    !  (cast)  ~   +   -           ++  -- ( 증감연산자 ) Ex03_02.java
		 * 2. 산술 연산자     *  / %
		 *                           +  -
		 *                           >> << >>> 쉬프트 연산자    Ex03_04.java
		 * 3. 비교 연산자    <   >   <=   >=                           instanceof(클래스수업할때 할게요)    
		 *                           ==   !=
		 * 4. 논리 연산자     &      ( 암기 )
		 *                           ^
		 *                           |
		 *                           &&
		 *                           || 
		 * 5. 삼항 연산자 == 조건연산자                  항1 ? 항2 : 항3             Ex03_05.java
		 * [6]. 대입 연산자   =  +=  -= 등등
		 * 
		 * [1][6]  처리방향   :  왼쪽    <-------   오른쪽
		 * 그외는       "           :  왼쪽    ------->   오른쪽
		 * */
		
		 // int i = +10;  양수
		 // int i = -10;  음수

	}

}






