package days03;

/**
 * @author kenik
 * @date 2023. 1. 30. - 오후 2:15:35
 * @subject  실수 -> 2진수 표현
 * @content
 *
 */
public class Ex03 {

	public static void main(String[] args) {
		/*
		 * 1. 실수 ?   . 소수점
		 *     3.14
		 *     3.0
		 *     3.
		 * 2. 자바에서 숫자>실수 - float(4), double(8)
		 *     
		 *    float    [S][8][][][][][][] [E] [23][][][][][][] [][][][][][][][] [][][][][][][][M]     32자리
		 *                        127+1=128 
		 *                   0   10000000    1101
		 *    double [S][11][][][][][][] [][][E][52][M][][][] [][][][][][][][] [][][][][][][][]     [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][]
		 *    
		 *    float  단정도 정밀도   23
		 *    double 배정도 정밀도  52
		 *     
		 *    
		 *    3.625 실수
		 *    3         -> 2진수    11
		 *    0.625 -> 2진수    101
		 *    
		 *    0.625 * 2 =  [1].25
		 *    0.25 * 2   =   [0].5
		 *    0.5   * 2    =  [1].0
		 *      :
		 *      :
		 *      :
		 *      
		 *      부동소수점표기
		 *      11.101
		 *      1.1101 x         2^1
		 *          가수               지수
		 *      
		 *      예) 0.0001010101111
		 *      1.010101111  x2^-4
		 *    
		 *    정수 
		 *    int      [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][]
		 *    long   [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][]     [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][]
		 *    
		 *    (기억)
		 *    9.1234567  유한소수 ->  2진수  무한소수
		 *                                         1001.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
		 *                                         부동소수점표기
		 *                                         1.0010001111110011010110 11011... x2^3
		 *                                         flot 가수 23비트 0010001111110011010110                                         
		 *                                         double 가수 52비트 00100011111100110101100010001111110011010110
		 *                                         
		 *                                         메모리 f/d 저장 오차발생하는 자료형 ****
		 *   실수는 무조건 오차가 적은 double로 선언한다. 
		 *   
		 *   [     BigDecimal 클래스  ]
		 * */ 
		
		// [문제] 키와 몸무게  저장할 변수를 선언하세요.. 
		// 키       : 179.8cm  실수   float,
		// 몸무게 : 65.6kg    실수  double
		
		// Type mismatch: cannot convert from int to byte
		// byte age = 300;
		//         byte      =  int
		
		// Type mismatch: cannot convert from long to int
		// int n = 1L;
		// int = long
		
		/*  다른 자료형(타입) 이다... 
		0    int        [][][][]                      크기 + 저장형태 X
		0.   double [][][][][][][][]
		0D  double		
		0F  float    [][][][]
		0L long      [][][][][][][][]
		
		d, D, f, F, l, L 접미사....
		*/
		
		// Type mismatch: cannot convert from double to float
		// float height = 179.8;
		 // float     =  double;  타입 불일치
		float height = 179.8F;  // 접미사    f,  F
		double weight = 65.6D;
		
		// 실수   conversion    f
		System.out.printf("키=%f, 몸무게=%f\n", height, weight);

	} // main

} // class








