package days04;

/**
 * @author dlsgu
 * @date 2023. 1. 31. 오전 11:23:08
 * @subject
 * @content
 */
public class Ex03 {

	public static void main(String[] args) {
		/*
		 * [연산자 우선순위 높은 것부터 정리]
		 * 1. 단항 연산자 ! (cast) ~ +(양수) -(음수) / ++ -- (증감연산자) Ex03_02
		 * 2. 산술 연산자 * / %
		 * 				  + -
		 * 				  >> << >>> (쉬프트 연산자) Ex03_04
		 * 3. 비교 연산자 > < >= <= / instanceof(클래스 수업 할 때 할 예정)
		 * 				  == !=
		 * 4. 논리 연산자 &    (암기)
		 * 				  ^
		 * 				  |
		 * 				  &&
		 * 				  ||
		 * 5. 삼항 연산자 == 조건연산자  항1 ? 항2 : 항3 Ex03_05
		 * 6. 대입 연산자 = += -= 등등
		 * 
		 * 1. 6. 처리방향: 왼쪽 <------ 오른쪽
		 * 그 외 처리방향: 왼쪽 ------> 오른쪽
		 * */
		
		int i = +10;

	}//main

}//class
