package days13;

/**
 * @author dlsgu
 * @date 2023. 2. 13. 오전 10:42:50
 * @subject ***다차원 배열 개념 이해***
 * @content	
 * 1. 다차원 배열:	2차원 이상의 배열을 다차원 배열이라고 한다
 * 					2차원***, 3차원...(메모리 허용)
 * 2. 1차원 배열 - 열(지금까지 사용했던 배열은 모두 1차원 배열이다)
 * 	  2차원 배열 - 행, 열
 *    3차원 배열 - 면, 행, 열
 */
public class Ex03 {

	public static void main(String[] args) {
		// [1학년] 3반 - 국어점수
		// 1반에 30명 학생 - 국어점수
		// int [] kors = new int[30];
		// 3반

		// 3행 30열 - 2차원 배열로 선언
		// int [][] kors = new int[3][30];
		// 2반 15번 학생 -> kors[1][14]
		// 3반 10번 학생 -> kors[2][9]
		
		// 3학년
		// 각 학년마다 5반
		// 각 반마다 30명 학생
		// 학생들의 국어점수를 저장/관리
		
		// 1차원 배열선언
		// int [] kors = new int[450];
		// 2차원 배열선언
		// 3차원 배열선언
		
	}//main

}//class
