package days06;

/**
 * @author kenik
 * @date  2023. 2. 2. - 오후 4:56:26
 * @subject 
 * @content 
 *
 */
public class Ex06 {

	public static void main(String[] args) {
		        // 1번 문제
				// *
				// **
				// ***
				// ****

				// 2번 문제
				// ****
				// ***
				// **
				// *
				
				// 3번 문제
				// ___*
				// __**
				// _***
				// ****


				// 4번 문제
				// ****
				// _***
				// __**
				// ___*

				// 5번 문제 ( 이등변 삼각형 )
				// __*
				// _***
				// *****


				// 6번 문제( 마름모 )
				// __*
				// _***
				// *****
				// _***
				// __*

				// 7번 문제  Ex05_07.java
				// *
				// _*
				// __*
				// ___*
				// ____*

				// 8번 문제  Ex05_08.java
				// ____*
				// ___*
				// __*
				// _*
				// *

				// 9번 문제  Ex05_09.java
				// *___*
				// _*_*
				// __*
				// _*_*
				// *___*


	} // main

} // class
